# CC_CircuitFromShape

## Description
Creates circuit from the given shape. The shape must be line, polygon or polyline. Returns the handle of the created circuit.

```pascal
FUNCTION CC_CircuitFromShape(hObj : HANDLE) : HANDLE;
```

```python

def vs.CC_CircuitFromShape(hObj):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||

## Version
Availability: from Vectorworks 2022
## Category
* ConnectCAD